---
kind: method
id: M:Autodesk.Revit.DB.BoundingBoxIntersectsFilter.GetBoundingBox
source: html/2b287737-ceae-f54f-fccf-7012fd9b6703.htm
---
# Autodesk.Revit.DB.BoundingBoxIntersectsFilter.GetBoundingBox Method

Gets the outline being used for this filter.

## Syntax (C#)
```csharp
public Outline GetBoundingBox()
```

## Returns
The outline being used for this filter.